Revit 2027 API
RebarConstraint.SetConstraintToRebarEdgeProperties Method
 Sets the properties of the constraint to target rebar edges.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetConstraintToRebarEdgeProperties(
	ConstraintToRebarEdgeProperties properties
)
Public Sub SetConstraintToRebarEdgeProperties (
	properties As ConstraintToRebarEdgeProperties
)
public:
void SetConstraintToRebarEdgeProperties(
	ConstraintToRebarEdgeProperties^ properties
)
member SetConstraintToRebarEdgeProperties :
        properties : ConstraintToRebarEdgeProperties -> unit
Parameters
properties ConstraintToRebarEdgeProperties
 The properties that will be set.
Exceptions
Exception | Condition
ArgumentException |  The input properties are not for an existing target of the constraint.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  RebarConstraint is no longer valid. -or- The TargetRebarConstraintType should be 'Edge'.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace